
public class Ex01변수 {

	public static void main(String[] args) {
		//변수 
		// 프로그래밍에서 데이터를 담을수 있는 공간
		// a라는 공간에 정수형 숫자 데이터 3을 저장
		//자료형 변수명 = 변수에 저장하고 싶은 데이터 ;
		int a = 3; // 선언 및 초기화
		System.out.println(a);
		
		// b라는 공간에 정수형 데이터 5를 저장
		// 1) 선언 
		int b;
		// 2) 초기화 (할당): 변수에 처음으로 값을 대입하는 것
		b = 5;
		//b에 7을 넣고싶으면
		b = 7;
		// 변수의 선언은 클래스에서 딱 한번만 할 수 있다.
		//int b = 7; 불가
		// 3) 재할당
		// - 변수는 한번 값을 대입하고 나면 뒤쪽에서 또 다른 값을 
		//   넣어줄수가 있다.
		System.out.println(b);
		
		// 프로그래밍 언어를 기계어로 번역해주는 작업이 컴파일이다.
		

	}

}
