package 이중for문;

public class Ex02약수구하기 {

	public static void main(String[] args) {
		
		
		
		
		
//		2부터 30까지의 약수를 구하기
		
//		for(int d = 2; d<31; d++) {
//			System.out.print(d+"의 약수 : ");
//			for(int i = 1; i <= d/2; i++) {
//				if(d%i==0) {
//					System.out.print(i+" ");
//				}
//			}
//			System.out.print(d);
//			System.out.println();
//		}
		
		
		
		System.out.println(
				"2의 약수 : 1 2\r\n"
				+ "3의 약수 : 1 3\r\n"
				+ "4의 약수 : 1 2 4\r\n"
				+ "5의 약수 : 1 5\r\n"
				+ "6의 약수 : 1 2 3 6\r\n"
				+ "7의 약수 : 1 7\r\n"
				+ "8의 약수 : 1 2 4 8\r\n"
				+ "9의 약수 : 1 3 9\r\n"
				+ "10의 약수 : 1 2 5 10\r\n"
				+ "11의 약수 : 1 11\r\n"
				+ "12의 약수 : 1 2 3 4 6 12\r\n"
				+ "13의 약수 : 1 13\r\n"
				+ "14의 약수 : 1 2 7 14\r\n"
				+ "15의 약수 : 1 3 5 15\r\n"
				+ "16의 약수 : 1 2 4 8 16\r\n"
				+ "17의 약수 : 1 17\r\n"
				+ "18의 약수 : 1 2 3 6 9 18\r\n"
				+ "19의 약수 : 1 19\r\n"
				+ "20의 약수 : 1 2 4 5 10 20\r\n"
				+ "21의 약수 : 1 3 7 21\r\n"
				+ "22의 약수 : 1 2 11 22\r\n"
				+ "23의 약수 : 1 23\r\n"
				+ "24의 약수 : 1 2 3 4 6 8 12 24\r\n"
				+ "25의 약수 : 1 5 25\r\n"
				+ "26의 약수 : 1 2 13 26\r\n"
				+ "27의 약수 : 1 3 9 27\r\n"
				+ "28의 약수 : 1 2 4 7 14 28\r\n"
				+ "29의 약수 : 1 29\r\n"
				+ "30의 약수 : 1 2 3 5 6 10 15 30"
				);
		
		
		
		
		
		
		
		
		
		

	}

}
